Revit 2027 API
Stairs.IsByComponent Method
 Indicates if the stairs is created by stairs components(runs, landings and supports).
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsByComponent(
	Document document,
	ElementId stairsId
)
Public Shared Function IsByComponent (
	document As Document,
	stairsId As ElementId
) As Boolean
public:
static bool IsByComponent(
	Document^ document,
	ElementId^ stairsId
)
static member IsByComponent :
        document : Document *
        stairsId : ElementId -> bool
Parameters
document Document
 The document.
stairsId ElementId
 The stairs element to check.
Return Value
Boolean
 True if the stairs is created by components, False otherwise.
Exceptions
Exception | Condition
ArgumentException |  The element stairsId does not exist in the document
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Stairs Class
Autodesk.Revit.DB.Architecture Namespace